articles/2016-Zimmermann2016/Zimmermann2016.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-06-23 ter 12:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Microservices tenets: Agile approach to service development and deployment (Review)</title>
<meta name="generator" content="Org mode" />

<link rel="stylesheet" type="text/css" href="../../HtmlTemplate/ccReport.css" />
<meta name="docClass" content= "Review">





</head>
<body>
<div id="content">
<h1 class="title">Microservices tenets: Agile approach to service development and deployment (Review)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaddbbdc">1. <span class="done DONE">DONE</span> Overview</a></li>
<li><a href="#org57e00b7">2. <span class="done DONE">DONE</span> Comments</a></li>
</ul>
</div>
</div>
<p>
Zimmermann, O. (2016). Microservices tenets: Agile approach to service development and deployment. Computer Science - Research and Development. <a href="http://doi.org/10.1007/s00450-016-0337-0">http://doi.org/10.1007/s00450-016-0337-0</a>
</p>

<div id="outline-container-orgaddbbdc" class="outline-2">
<h2 id="orgaddbbdc"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
This paper analyzes the literature on microservices to identify its tenets. The analysis confirms that microservices can be seen as a variant of SOA in terms of development. In other words, microservices represent one particular approach to implementing SOA. The differences between microservices and SOA are not related to the architectural style, but the concrete realization.
</p>

<p>
This paper identifies seven microservices tenets:
</p>
<ol class="org-ol">
<li><b>Fine-grained interfaces</b>: aims at single-responsibility units that can be deployed, changed, replaced, and scaled independently.</li>
<li><b>Business-driven development</b>: aims at identifying and conceptualize services.</li>
<li><b>Cloud-native application</b>: summarized in IDEAL (isolated state, distribution, elasticity, automated management and loose coupling) or Heroku's twelve app factors.</li>
<li><b>Multiple computing paradigms</b>: polyglot programming and persistence strategy.</li>
<li><b>Lightweight containers</b>: used to deploy services.</li>
<li><b>Decentralized continuous delivery</b>: aims at reaching high levels of deployment automation and autonomy.</li>
<li><b>DevOps</b>: aims at reaching high levels of automation for configuration, service monitoring, fault management, etc.</li>
</ol>


<p>
Concerning microservice definition, the author presents two contrary positions:
</p>
<ol class="org-ol">
<li>Microservices as new architectural style.</li>
<li>Microservices as one way of doing SOA.</li>
</ol>

<p>
In terms of SOA vs. microservices, most of the characteristics of microservices can be found in SOA patterns and best practices. The author presents a map that relates SOA characteristics to microservices. Hence, there is no evidence that microservices is a novel architectural style.
</p>

<p>
The author says that architectural styles are defined by design intent, principles, and patters, or via technical constraints. However, it is questionable whether process-related and organizational aspects should be included in such definitions.
</p>

<p>
This article brings some questions/concerns from practitioners. It is said that practitioners welcome guidance that shows more detailed and concrete solutions rather than frequent advice. Such questions/concerns encompass:
</p>
<ul class="org-ul">
<li>the use of REST and microservices;</li>
<li>if the Web protocols are sufficient;</li>
<li>if other remote communication approaches besides HTTP is valid;</li>
<li>how to deal with classic distributed issues:
<ul class="org-ul">
<li>data representations;</li>
<li>schema mismatches;</li>
<li>versioning.</li>
</ul></li>
<li>how to define machine-readable contracts;</li>
<li>semantic interoperability between services and consumers;</li>
<li>how to compose microservices;</li>
<li>intercommunication between microservices;</li>
<li>tools, libraries, frameworks and middlewares for microservices;</li>
<li>how to deal with rich/complex domain models with interconnected entities.</li>
</ul>

<p>
In conclusion, it states that HTTP+REST is the only approach to implement remote communication. Then, microservices contracts should handle at least HTTP and message queue protocols. It is an open question on how to create a larger processing unit from a collection of microservices. Another open question is related to patterns, such as API Gateway, that would be necessary to support microservices. Finally, in the response of people who have a negative perspective, the author states that SOA is here to stay.
</p>
</div>
</div>



<div id="outline-container-org57e00b7" class="outline-2">
<h2 id="org57e00b7"><span class="section-number-2">2</span> <span class="done DONE">DONE</span> Comments</h2>
<div class="outline-text-2" id="text-2">
<p>
I disagree with microservices tenets numbered from 4 to 7 could be considered tenets. Except for tenet number 4, they address issues related to post-building services. In other words, these tenets are applied after the microservice creation. With regard to tenet number 4, polyglot programming and persistence are important to make the development more independent, however, it does not affect the microservice itself. These tenets (from 4 to 7) would be better classified as optional microservice characteristics.
</p>

<p>
One of the identified (SOA and microservices) characteristic is related to smart endpoints and dumb pipes. Could service discovery and composition middlewares be considered as pipes? If so, the use of them could violate this characteristic?
</p>

<p>
The author points out an important issue when say that in software architecture, architectural styles are defined by design intent, principles and patterns, or via technical constraints. However, microservices are currently defined taking into account process-related and organization aspects. I think these two different aspects should be considered separately. Moreover, considering non-truly architectural aspects for modeling microservices could influence service reuse and composition.
</p>

<p>
This article addresses microservices compositions as an open question on how to create a larger processing unit from a collection of microservices. The author mentioned both the composition problem and the use of semantics more than once.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-02-04</p>
<p class="date">Created: 2020-06-23 ter 12:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
